In [2]:
%load_ext sql
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

In [5]:
%sql sqlite:///my_database.db

In [6]:
%%sql
SELECT * 
FROM employees

 * sqlite:///my_database.db
Done.

[(1, 'Alice', 'Smith', 1, '2010-06-01', 120000.0, 10000.0, 'CTO', None, 5, 'alice.smith@example.com', '555-0100'),
 (2, 'Bob', 'Johnson', 1, '2012-09-15', 90000.0, 5000.0, 'Senior Engineer', 1, 4, 'bob.johnson@example.com', '555-0101'),
 (3, 'Carol', 'Williams', 1, '2015-03-20', 80000.0, None, 'Engineer', 2, 3, 'carol.williams@example.com', '555-0102'),
 (4, 'David', 'Jones', 2, '2011-11-11', 95000.0, 7000.0, 'Sales Manager', None, 4, 'david.jones@example.com', '555-0103'),
 (5, 'Eva', 'Brown', 2, '2016-05-22', 70000.0, 3000.0, 'Sales Representative', 4, 3, 'eva.brown@example.com', '555-0104'),
 (6, 'Frank', 'Davis', 2, '2018-07-01', 68000.0, None, 'Sales Representative', 4, 2, 'frank.davis@example.com', '555-0105'),
 (7, 'Grace', 'Miller', 3, '2013-02-28', 75000.0, 4000.0, 'HR Specialist', None, 4, 'grace.miller@example.com', '555-0106'),
 (8, 'Henry', 'Wilson', 3, '2019-10-10', 60000.0, 2000.0, 'HR Assistant', 7, 3, 'henry.wilson@example.com', '555-0107'),
 (9, 'Ivy', 'Moore', 4, '2014-08-19', 85000.0, 5000.0, 'Marketing Manager', None, 4, 'ivy.moore@example.com', '555-0108'),
 (10, 'Sam', 'White', None, '2023-01-01', 50000.0, None, 'Intern', 3, None, None, None),
 (11, 'Jack', 'Taylor', 4, '2020-01-15', 65000.0, None, 'Marketing Specialist', 9, 3, 'jack.taylor@example.com', '555-0109'),
 (12, 'Kathy', 'Anderson', 5, '2017-04-03', 78000.0, 4500.0, 'Finance Analyst', None, 4, 'kathy.anderson@example.com', '555-0110'),
 (13, 'Leo', 'Thomas', 5, '2021-12-05', 55000.0, None, 'Junior Finance Analyst', 11, 3, 'leo.thomas@example.com', '555-0111')]

Write a query to find first name and last name of employees whose first name:
has 3 letters
ends in 'a'

In [10]:
%%sql
SELECT first_name,	last_name
FROM employees
WHERE LENGTH(first_name) = 3;

 * sqlite:///my_database.db
Done.

[('Bob', 'Johnson'),
 ('Eva', 'Brown'),
 ('Ivy', 'Moore'),
 ('Sam', 'White'),
 ('Leo', 'Thomas')]

In [11]:
%%sql
SELECT first_name,	last_name
FROM employees
WHERE first_name LIKE '%a';

 * sqlite:///my_database.db
Done.

[('Eva', 'Brown')]

2) Write a query to find, for each department:
- the name of the department
- the number of employees
- the number of employees who received a bonus
- the total amount of bonuses disbursed

In [12]:
%%sql
SELECT *
FROM departments

 * sqlite:///my_database.db
Done.

[(1, 'Engineering', 'New York'),
 (2, 'Sales', 'Los Angeles'),
 (3, 'HR', 'Chicago'),
 (4, 'Marketing', 'San Francisco'),
 (5, 'Finance', 'Boston')]

In [16]:
%%sql
SELECT name 
FROM departments

 * sqlite:///my_database.db
Done.

[('Engineering',), ('Sales',), ('HR',), ('Marketing',), ('Finance',)]

In [46]:
%%sql
SELECT department_id, COUNT(department_id) AS num_employees
FROM employees
WHERE department_id IN (1,2,3,4,5)
GROUP BY department_id

 * sqlite:///my_database.db
Done.

[(1, 3), (2, 3), (3, 2), (4, 2), (5, 2)]

In [55]:
%%sql
SELECT department_id, COUNT(bonus) AS num_bonus
FROM employees
GROUP BY department_id
LIMIT 5 OFFSET 1

 * sqlite:///my_database.db
Done.

[(1, 2), (2, 2), (3, 2), (4, 1), (5, 1)]

In [57]:
%%sql
SELECT COUNT(bonus) AS tot_num_bonus
FROM employees

 * sqlite:///my_database.db
Done.

[(8,)]

Bonus exercise
3) Write a query to find employees who received the same bonus as at least one other employee.

In [74]:
%%sql
SELECT first_name ||' ' || last_name AS full_name, COUNT(id) AS num_same_bonus, bonus
FROM employees
GROUP BY bonus
HAVING COUNT(id) > 1

 * sqlite:///my_database.db
Done.

[('Carol Williams', 5, None), ('Bob Johnson', 2, 5000.0)]

In [91]:
%%sql
SELECT first_name ||' ' || last_name AS full_name, bonus
FROM employees
WHERE bonus = 5000 OR bonus IS NULL

 * sqlite:///my_database.db
Done.

[('Bob Johnson', 5000.0),
 ('Carol Williams', None),
 ('Frank Davis', None),
 ('Ivy Moore', 5000.0),
 ('Sam White', None),
 ('Jack Taylor', None),
 ('Leo Thomas', None)]